In [1]:
import pandas as pd

In [4]:
people = {
    "first" : ["John", "Cristiano", "Alex"],
    "last" : ["Doe", "Ronaldo", "Ferguson"],
    "age" : [24, 40, 68]
}

df = pd.DataFrame(people)
df

       first      last  age
0       John       Doe   24
1  Cristiano   Ronaldo   40
2       Alex  Ferguson   68

In [10]:
# so what we're seeing below is called a series. And we can say that a dataframe is a collection/container of multipler series'
print(type(df['first']))    #<class 'pandas.core.series.Series'>
df['first']

# we can think of the "first" column as a series, the "last" column as a series and so on...

<class 'pandas.core.series.Series'>

0         John
1    Cristiano
2         Alex
Name: first, dtype: object

In [20]:
df['first'] + ' ' + df['last']
df.age                         # same thing achieved by using '.'
df.count

<bound method DataFrame.count of        first      last  age
0       John       Doe   24
1  Cristiano   Ronaldo   40
2       Alex  Ferguson   68>

In [21]:
df[['first', 'last']]

       first      last
0       John       Doe
1  Cristiano   Ronaldo
2       Alex  Ferguson